cases/0-FlowMonople2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (68.0 0 0);

boundaryField
{
    "inlet|top|bottom"
    {
          type            fixedValue;
		  value			  $internalField;
    }
	
	"outlet"
    {
          type            zeroGradient;
    }

    "front|back"
    {
        type            empty;
    }

}

// ************************************************************************* //
