cases/0-FlowMonople2D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmax	    	3.0;
xmin		   -3.0;
ymax	    	3.0;
ymin		   -3.0;
zmax	    	1.0e-2;
zmin		   -1.0e-2;
npt		512;
vertices
(
	($xmin		$ymin	$zmin)
	($xmax		$ymin	$zmin)
	($xmax		$ymax	$zmin)
	($xmin		$ymax	$zmin)
	($xmin		$ymin	$zmax)
	($xmax		$ymin	$zmax)
	($xmax		$ymax	$zmax)
	($xmin		$ymax	$zmax)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($npt $npt 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

    front
    {
        type empty;
        faces
        (
            (0 3 2 1)
        );
    }
    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }           
);

// ************************************************************************* //
