cases/0-FlowMonople2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     wcAeroSource;

startFrom       latestTime; //;startTime

startTime       0.0;

stopAt          endTime;

endTime         1.e-2;

deltaT          1e-5;

writeControl    adjustableRunTime;

writeInterval   1e-2;

purgeWrite      200;

writeFormat     binary; // binary;

writePrecision  9;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  false;

maxCo           0.5;

maxDeltaT       1e-5;

functions
{	
	fieldAverage
    {
        type                fieldAverage;
        libs                (fieldFunctionObjects);

        fields
        (

            U
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  off;
                base        time;
            }
        );

        timeStart           0;
        executeControl      timeStep;
        executeInterval     10;
        writeControl        onEnd;
    }

/*
    // runtime sampling/probe   
    	#includeFunc  probes_arc05
	#includeFunc  probes_arc10
	#includeFunc  probes_arc15
	#includeFunc  probes_Xaxis
	#includeFunc  probes_Yaxis
*/

}



// ************************************************************************* //

/*


fieldAverage1
{
    type                fieldAverage;
    libs                ("libfieldFunctionObjects.so");

    writeControl        writeTime;

    restartOnRestart    false;
    restartOnOutput     false;
    periodicRestart     false;

    fields
    (
        U
        {
            mean            on;
            prime2Mean      on;
            base            time;
            windowType      exact;
            window          10.0;
            windowName      w1;
            allowRestart    no;
        }
    );
}
*/
/*


    // output time sampling
    pSamping
    {
        type sets;
        enabled true;
        verbose true;
        interpolationScheme cellPoint;
        outputControlMode   outputTime;
        outputInterval 1;
        setFormat raw;
        fields ( p );
        sets
        (
          xAxis
          {
            type uniform;
            axis y;
            start ( 0.1  0 0 );
            end   ( 3.0  0 0 );
            nPoints 300;
          }
          yAxis
          {
            type uniform;
            axis y;
            start ( 0 0.1  0 );
            end   ( 0 3.0  0 );
            nPoints 300;
          }
        );
    }
*/
