cases/0-FlowMonople2D/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    	default         		backward;//backward; // Euler
}

gradSchemes
{
    	default         		Gauss linear;
}

divSchemes
{
    	default         	 	none;

	/*! wcFoam option */
	div(phi,p)			Gauss linear;

	
	div(phi,U)			Gauss LUST grad(U);

	/*! turbulence */
    	div(phi,k)  			bounded Gauss upwind;
	div(phi,epsilon) 		bounded Gauss upwind;
	div(phi,R)      		bounded Gauss upwind;
	div(phi,nuTilda) 		bounded Gauss upwind;
	div(R)          		Gauss linear;
	

	/*! pimpleFoam options */
	div((nuEff*dev2(T(grad(U))))) Gauss linear;


}

laplacianSchemes
{
	default         Gauss linear corrected;
}

interpolationSchemes
{
    	default         linear;
}

snGradSchemes
{
	default         corrected;
}


wallDist
{
	method		meshWave;
}	

// ************************************************************************* //
